lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/external/zboss/osif/zb_nrf52_transceiver.c
/* ZBOSS Zigbee 3.0
 *
 * Copyright (c) 2012-2018 DSR Corporation, Denver CO, USA.
 * http://www.dsr-zboss.com
 * http://www.dsr-corporation.com
 * All rights reserved.
 *
 *
 * Use in source and binary forms, redistribution in binary form only, with
 * or without modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 2. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 3. This software, with or without modification, must only be used with a Nordic
 *    Semiconductor ASA integrated circuit.
 *
 * 4. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR
 * TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
PURPOSE: MAC nRF52840 radio driver specific.
*/

#define ZB_TRACE_FILE_ID 28283
#include "zboss_api.h"

#include "nrf_802154_const.h"
#ifdef __GNUC__
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-align"
#pragma GCC diagnostic ignored "-Wdeclaration-after-statement"
#endif
#include "nrf_802154.h"
#ifdef __GNUC__
#pragma GCC diagnostic pop
#endif
#include "mac_nrf52_transceiver.h"

#if !defined NRF_802154_FRAME_TIMESTAMP_ENABLED || !NRF_802154_FRAME_TIMESTAMP_ENABLED
#error Must define NRF_802154_FRAME_TIMESTAMP_ENABLED!
#endif

#ifdef ENABLE_FEM
#include "nrf_gpio.h"

#if defined(NRF_FEM_CONTROL_DEFAULT_PA_PIN) && defined(NRF_FEM_CONTROL_DEFAULT_LNA_PIN) && defined(NRF_FEM_CONTROL_DEFAULT_PDN_PIN)
/** Macro with default configuration of the 3-pin FEM module. */
#ifndef ZB_FEM_SETTINGS
#define ZB_FEM_SETTINGS                                                 \
    {                                                                   \
        .fem_config =                                                   \
        {                                                               \
            .pa_time_gap_us  = NRF_FEM_PA_TIME_IN_ADVANCE_US,           \
            .lna_time_gap_us = NRF_FEM_LNA_TIME_IN_ADVANCE_US,          \
            .pdn_settle_us   = NRF_FEM_PDN_SETTLE_US,                   \
            .trx_hold_us     = NRF_FEM_TRX_HOLD_US,                     \
            .pa_gain_db      = 0,                                       \
            .lna_gain_db     = 0                                        \
        },                                                              \
        .pa_pin_config =                                                \
        {                                                               \
            .enable       = FEM_CONTROL_DEFAULT_ENABLE,                 \
            .active_high  = 1,                                          \
            .gpio_pin     = FEM_CONTROL_DEFAULT_PA_PIN,                 \
            .gpiote_ch_id = NRF_FEM_CONTROL_DEFAULT_PA_GPIOTE_CHANNEL   \
        },                                                              \
        .lna_pin_config =                                               \
        {                                                               \
            .enable       = FEM_CONTROL_DEFAULT_ENABLE,                 \
            .active_high  = 1,                                          \
            .gpio_pin     = FEM_CONTROL_DEFAULT_LNA_PIN,                \
            .gpiote_ch_id = NRF_FEM_CONTROL_DEFAULT_LNA_GPIOTE_CHANNEL  \
        },                                                              \
        .pdn_pin_config =                                               \
        {                                                               \
            .enable       = FEM_CONTROL_DEFAULT_ENABLE,                 \
            .active_high  = 1,                                          \
            .gpio_pin     = FEM_CONTROL_DEFAULT_PDN_PIN,                \
            .gpiote_ch_id = NRF_FEM_CONTROL_DEFAULT_PDN_GPIOTE_CHANNEL  \
        },                                                              \
        .ppi_ch_id_set = NRF_FEM_CONTROL_DEFAULT_SET_PPI_CHANNEL,       \
        .ppi_ch_id_clr = NRF_FEM_CONTROL_DEFAULT_CLR_PPI_CHANNEL,       \
        .ppi_ch_id_pdn = NRF_FEM_CONTROL_DEFAULT_PDN_PPI_CHANNEL        \
    }
#endif // ZB_FEM_SETTINGS

#elif defined(NRF_FEM_CONTROL_DEFAULT_PA_PIN) && defined(NRF_FEM_CONTROL_DEFAULT_LNA_PIN)
/** Macro with default configuration of the 2-pin FEM module. */
#ifndef ZB_FEM_SETTINGS
#define ZB_FEM_SETTINGS                                                 \
    {                                                                   \
        .fem_config =                                                   \
        {                                                               \
            .pa_time_gap_us  = NRF_FEM_PA_TIME_IN_ADVANCE_US,           \
            .lna_time_gap_us = NRF_FEM_LNA_TIME_IN_ADVANCE_US,          \
            .pa_gain_db      = 0,                                       \
            .lna_gain_db     = 0                                        \
        },                                                              \
        .pa_pin_config =                                                \
        {                                                               \
            .enable       = FEM_CONTROL_DEFAULT_ENABLE,                 \
            .active_high  = 1,                                          \
            .gpio_pin     = FEM_CONTROL_DEFAULT_PA_PIN,                 \
            .gpiote_ch_id = NRF_FEM_CONTROL_DEFAULT_PA_GPIOTE_CHANNEL   \
        },                                                              \
        .lna_pin_config =                                               \
        {                                                               \
            .enable       = FEM_CONTROL_DEFAULT_ENABLE,                 \
            .active_high  = 1,                                          \
            .gpio_pin     = FEM_CONTROL_DEFAULT_LNA_PIN,                \
            .gpiote_ch_id = NRF_FEM_CONTROL_DEFAULT_LNA_GPIOTE_CHANNEL  \
        },                                                              \
        .ppi_ch_id_set = NRF_FEM_CONTROL_DEFAULT_SET_PPI_CHANNEL,       \
        .ppi_ch_id_clr = NRF_FEM_CONTROL_DEFAULT_CLR_PPI_CHANNEL        \
    }
#endif // ZB_FEM_SETTINGS

#else
#error Unsupported FEM type
#endif

