lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/external/zboss/osif/zb_nrf52_transceiver.c
#endif //ENABLE_FEM


static zb_uint8_t zb_transceiver_set_state(nrf_802154_state_t new_state);
extern void nrf_802154_transmit_csma_ca_raw(const uint8_t * p_data);

#ifdef ENABLE_FEM
ZB_WEAK_PRE void ZB_WEAK nrf_fem_gpio_configure(void)
{
#if defined(NRF_FEM_CONTROL_DEFAULT_PA_PIN) && defined(NRF_FEM_CONTROL_DEFAULT_LNA_PIN) && defined(NRF_FEM_CONTROL_DEFAULT_PDN_PIN)
    // Set default FEM pin direction.
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_PA_PIN);
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_LNA_PIN);
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_PDN_PIN);
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_MODE_PIN);
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_ANTSEL_PIN);

    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_MOSI_PIN);
    nrf_gpio_cfg_default(FEM_CONTROL_DEFAULT_MISO_PIN);
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_CLK_PIN);
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_CSN_PIN);

    // Set default FEM pin polarity.
    nrf_gpio_pin_clear(FEM_CONTROL_DEFAULT_PA_PIN);     // Disable PA, radio driver will override this setting
    nrf_gpio_pin_clear(FEM_CONTROL_DEFAULT_LNA_PIN);    // Disable LNA, radio driver will override this setting
    nrf_gpio_pin_clear(FEM_CONTROL_DEFAULT_PDN_PIN);    // Disable FEM, radio driver will override this setting
    nrf_gpio_pin_clear(FEM_CONTROL_DEFAULT_MODE_PIN);   // Use POUTA_PROD TX gain by default
    nrf_gpio_pin_clear(FEM_CONTROL_DEFAULT_ANTSEL_PIN); // Use antenna at "ANT1" port by default

    nrf_gpio_pin_set(FEM_CONTROL_DEFAULT_MOSI_PIN);     // SPI mode not used. Use high polarity by default.
    nrf_gpio_pin_set(FEM_CONTROL_DEFAULT_CLK_PIN);      // SPI mode not used. Use high polarity by default.
    nrf_gpio_pin_clear(FEM_CONTROL_DEFAULT_CSN_PIN);    // SPI mode not used. Use low polarity by default.

#elif defined(NRF_FEM_CONTROL_DEFAULT_PA_PIN) && defined(NRF_FEM_CONTROL_DEFAULT_LNA_PIN)
    // Set default FEM pin direction.
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_PA_PIN);     // CTX (PA, controlled by radio driver)
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_LNA_PIN);    // CRX (LNA, controlled by radio driver)
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_PDN_PIN);    // CSD (enable, managed by the application)
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_MODE_PIN);   // CHL (enables transmit high-power mode, managed by the application)
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_ANTSEL_PIN); // ANT_SEL (select antenna output, managed by the application)
    nrf_gpio_cfg_output(FEM_CONTROL_DEFAULT_CSN_PIN);    // CPS (enables bypass mode, managed by the application)

    // Set default FEM pin polarity.
    nrf_gpio_pin_clear(FEM_CONTROL_DEFAULT_PA_PIN);     // Disable PA, radio driver will override this setting
    nrf_gpio_pin_clear(FEM_CONTROL_DEFAULT_LNA_PIN);    // Disable LNA, radio driver will override this setting
    nrf_gpio_pin_set(FEM_CONTROL_DEFAULT_PDN_PIN);      // Enable FEM module by default
    nrf_gpio_pin_set(FEM_CONTROL_DEFAULT_MODE_PIN);     // Use transmit high-power mode by default
    nrf_gpio_pin_clear(FEM_CONTROL_DEFAULT_ANTSEL_PIN); // Use antenna at "ANT1" port by default
    nrf_gpio_pin_clear(FEM_CONTROL_DEFAULT_CSN_PIN);    // Disable bypass mode by default

#else
#error Unsupported FEM type
#endif
}
#endif

/**
   Reset transceiver HW at mlme-reset time
*/
void zb_transceiver_hw_init(void)
{
  nrf_802154_init();

  /*Configure FEM*/
#ifdef ENABLE_FEM
#ifdef FEM_CONTROL_DEFAULT_ENABLE
  if (FEM_CONTROL_DEFAULT_ENABLE)
  {
    nrf_fem_gpio_configure();
  }
#endif
  nrf_fem_interface_config_t fem_config = ZB_FEM_SETTINGS;
  int32_t err_code = nrf_fem_interface_configuration_set(&fem_config);
  ZB_ASSERT(err_code == NRF_SUCCESS);
#endif

  /*Perform radio driver configuration*/
  zb_nrf_802154_mac_osif_init();
  nrf_802154_auto_ack_set(ZB_TRUE);
  (void)zb_transceiver_set_state(NRF_802154_STATE_SLEEP);
  /* FIXME: Why it is needed here? Why it is called directly, not via src_match() API? */
  /* ZB_SRC_MATCH_TBL_DROP(); */
#ifdef ZB_MACSPLIT_TRANSPORT_USERIAL
  /* If in split and use USB, need forst to init HW to init timer, then init USB serial. */
  zb_osif_userial_init();
#endif
  nrf_802154_src_addr_matching_method_set(NRF_802154_SRC_ADDR_MATCH_ZIGBEE);
}


void zb_transceiver_update_long_mac(zb_ieee_addr_t long_mac)
{
  /*Update the long addr in the nRF radio driver*/
  nrf_802154_extended_address_set(long_mac);
}

void zb_transceiver_set_pan_id(zb_uint16_t pan_id)
{
  TRACE_MSG(TRACE_MAC1, "zb_transceiver_set_pan_id 0x%x", (FMT__D, pan_id));
  nrf_802154_pan_id_set((zb_uint8_t *) (&pan_id));
}

void zb_transceiver_set_short_addr(zb_uint16_t addr)
{
  TRACE_MSG(TRACE_MAC1, "zb_transceiver_set_short_addr 0x%x", (FMT__D, addr));
  nrf_802154_short_address_set((zb_uint8_t *) (&addr));
}

void zb_transceiver_start_get_rssi(zb_uint8_t scan_duration_bi)
{
  while(!nrf_802154_energy_detection(ZB_TIME_BEACON_INTERVAL_TO_USEC(scan_duration_bi)));
}

/**
   Set channel and go to the normal (not ed scan) mode
*/
void zb_transceiver_set_channel(zb_uint8_t channel_number)
{
  TRACE_MSG(TRACE_MAC1, "zb_transceiver_set_channel %d", (FMT__D, channel_number));
  nrf_802154_channel_set(channel_number);
}

void zb_transceiver_set_tx_power(zb_int8_t power)
{
  nrf_802154_tx_power_set(power);
}

void zb_transceiver_get_tx_power(zb_int8_t* power)
{
  *power = (zb_int8_t)nrf_802154_tx_power_get();
}

/**
   Notify Nordic radio driver if we configured as the PAN coordinator
*/
void zb_transceiver_set_pan_coord(zb_bool_t pan_coord)
{
  TRACE_MSG(TRACE_MAC3, "zb_transceiver_set_pan_coord %hd", (FMT__H, pan_coord));
  nrf_802154_pan_coord_set((bool )pan_coord);
}

/**
   Enable or disable Auto ACK
*/
void zb_transceiver_set_auto_ack(zb_bool_t auto_ack)
{
  nrf_802154_auto_ack_set(auto_ack);
}

void zb_transceiver_set_promiscuous_mode(zb_bool_t enabled)
{
  nrf_802154_promiscuous_set(enabled);
}

void zb_transceiver_set_rx_on_off(int rx_on)
{
  TRACE_MSG(TRACE_MAC1, "mac_nrf52840_trans_set_rx_on_off %d", (FMT__D, rx_on));

  if (!rx_on)
  {
    (void)nrf_802154_sleep_if_idle();
  }
  else
  {
    (void)nrf_802154_receive();
  }
}

zb_bool_t zb_transceiver_get_rx_on_off(void)
{
  if (nrf_802154_state_get() == NRF_802154_STATE_RECEIVE)
  {
    return ZB_TRUE;
  }
  else
  {
    return ZB_FALSE;
  }
}

zb_bool_t zb_transceiver_is_idle(void)
{
  if (nrf_802154_state_get() == NRF_802154_STATE_SLEEP)
  {
    return ZB_TRUE;
  }
  else
  {
    return ZB_FALSE;
  }
}

