lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/external/zboss/osif/zb_nrf52_transceiver.c
zb_bool_t zb_transceiver_get_radio_on_off(void)
{
  TRACE_MSG(TRACE_MAC1, "mac_nrf52840_trans_get_radio_on_off", (FMT__0));
  if (nrf_802154_state_get() == NRF_802154_STATE_SLEEP)
  {
    return ZB_FALSE;
  }
  else
  {
    return ZB_TRUE;
  }
}

/*Set nRF driver radio state with checking the previouse state*/
static zb_uint8_t zb_transceiver_set_state(nrf_802154_state_t new_state)
{
  nrf_802154_state_t cur_state;
  zb_uint8_t ret = ZB_FALSE;
  cur_state = nrf_802154_state_get();
  if (cur_state != new_state)
  {
    switch (new_state)
    {
      case NRF_802154_STATE_SLEEP:
        if (cur_state == NRF_802154_STATE_RECEIVE)
        {
          ret = nrf_802154_sleep();
        }
        else
        {
          TRACE_MSG(TRACE_MAC1, "Can't set sleep state, RF not in Receive mode ", (FMT__0));
        }
        break;

      case NRF_802154_STATE_RECEIVE:
        if ((cur_state == NRF_802154_STATE_SLEEP) || (cur_state == NRF_802154_STATE_TRANSMIT))
        {
          (void)nrf_802154_receive();
        }
        else
        {
          TRACE_MSG(TRACE_MAC1, "Can't set sleep state, RF not in Receive mode ", (FMT__0));
        }
        break;
      case NRF_802154_STATE_TRANSMIT:
        break;
      case NRF_802154_STATE_ENERGY_DETECTION:
        break;
      case NRF_802154_STATE_CCA:
        break;
      default:
        TRACE_MSG(TRACE_MAC1, "nrf_set_state: bad param: %x ", (FMT__D, new_state));
    }
  }
  return ret;
}

zb_bool_t zb_transceiver_transmit(zb_uint8_t wait_type, zb_time_t tx_at, zb_uint8_t * tx_buf, zb_uint8_t current_channel)
{
  zb_bool_t transmit_status = ZB_FALSE;
#ifndef ZB_ENABLE_ZGP_DIRECT
  ZVUNUSED(tx_at);
  ZVUNUSED(current_channel);
#endif

  switch (wait_type)
  {
    case ZB_MAC_TX_WAIT_CSMACA:
#if !NRF_802154_CSMA_CA_ENABLED
      while(!transmit_status)
      {
        transmit_status = (zb_bool_t) nrf_802154_transmit_raw(tx_buf);
      }
      break;
#else
      transmit_status = ZB_TRUE;
      nrf_802154_transmit_csma_ca_raw(tx_buf);
#endif
      break;

#ifdef ZB_ENABLE_ZGP_DIRECT
    case ZB_MAC_TX_WAIT_ZGP:
      transmit_status = (zb_bool_t)nrf_802154_transmit_raw_at(
        tx_buf,
        0, /* cca */
      /* Our upper layers are already calculatet exact time to transmit. But
       * Nordic radio driver itseld is doing some calculations subtracting from
       * dt parameter. We do not want to change our upper layers, so let's just
       * subtract back from tx_at.
       * We may not care about tx_at overflows: if it overflowed in
       * cgp_data_req() in zgp_stub.c,
       * it goes back gere.
       * Yes, this is ugly, but we must use Nordic API which is not very good
       * for our upper logic.
       */
        tx_at - ZB_GPD_TX_OFFSET_US, /* t0 */
        ZB_GPD_TX_OFFSET_US,     /* dt */
        current_channel);
      break;
#endif
    case ZB_MAC_TX_WAIT_NONE:
      /* First transmit attempt without CCA. */
      transmit_status = (zb_bool_t) nrf_802154_transmit_raw(tx_buf, ZB_FALSE);
      break;
    default:
      TRACE_MSG(TRACE_MAC1, "Illegal wait_type parameter", (FMT__0));
      ZB_ASSERT(0);
      break;
  }
  return transmit_status;
}

/**
 * @brief Notify that frame was transmitted.
 *
 * @note If ACK was requested for transmitted frame this function is called after proper ACK is
 *       received. If ACK was not requested this function is called just after transmission is
 *       ended.
 * @note Buffer pointed by the @p p_ack pointer is not modified by the radio driver (and can't
 *       be used to receive a frame) until @sa nrf_802154_buffer_free_raw() function is
 *       called.
 * @note Buffer pointed by the @p p_ack pointer may be modified by the function handler (and other
 *       modules) until @sa nrf_802154_buffer_free_raw() function is called.
 * @note The next higher layer should handle @sa nrf_802154_transmitted_raw() or @sa
 *       nrf_802154_transmitted() function. It should not handle both.
 *
 * @param[in]  p_ack  Pointer to received ACK buffer. Fist byte in the buffer is length of the
 *                    frame (PHR) and following bytes are the ACK frame itself (PSDU). Length byte
 *                    (PHR) includes FCS. FCS is already verified by the hardware and may be
 *                    modified by the hardware.
 *                    If ACK was not requested @p p_ack is set to NULL.
 * @param[in]  power  RSSI of received frame or 0 if ACK was not requested.
 * @param[in]  lqi    LQI of received frame or 0 if ACK was not requested.
 */
void nrf_802154_transmitted_raw(const uint8_t * p_frame, uint8_t * p_ack, int8_t power, uint8_t lqi)
{
  ZVUNUSED(p_frame);
  ZVUNUSED(power);
  ZVUNUSED(lqi);

#if defined ZB_NRF52_RADIO_STATISTICS
  zb_nrf52_get_radio_stats()->tx_successful++;
#endif /* defined ZB_NRF52_RADIO_STATISTICS */

  mac_nrf52_transmitted_raw(p_ack);
}

void zb_transceiver_buffer_free(zb_uint8_t * p_buf)
{
  nrf_802154_buffer_free_raw(p_buf);
}

/**
 * @brief Notify that frame was not transmitted due to busy channel.
 *
 * This function is called if transmission procedure fails.
 *
 * @param[in]  error  Reason of the failure.
 */

void nrf_802154_transmit_failed(uint8_t const *p_frame, nrf_802154_tx_error_t error)
{
  ZVUNUSED(p_frame);
#if defined ZB_NRF52_RADIO_STATISTICS
  switch (error)
  {
    case NRF_802154_TX_ERROR_NONE:
      zb_nrf52_get_radio_stats()->tx_err_none++;
      break;
    case NRF_802154_TX_ERROR_BUSY_CHANNEL:
      zb_nrf52_get_radio_stats()->tx_err_busy_channel++;
      break;
    case NRF_802154_TX_ERROR_INVALID_ACK:
      zb_nrf52_get_radio_stats()->tx_err_invalid_ack++;
      break;
    case NRF_802154_TX_ERROR_NO_MEM:
      zb_nrf52_get_radio_stats()->tx_err_no_mem++;
      break;
    case NRF_802154_TX_ERROR_TIMESLOT_ENDED:
      zb_nrf52_get_radio_stats()->tx_err_timeslot_ended++;
      break;
    case NRF_802154_TX_ERROR_NO_ACK:
      zb_nrf52_get_radio_stats()->tx_err_no_ack++;
      break;
    case NRF_802154_TX_ERROR_ABORTED:
      zb_nrf52_get_radio_stats()->tx_err_aborted++;
      break;
    case NRF_802154_TX_ERROR_TIMESLOT_DENIED:
      zb_nrf52_get_radio_stats()->tx_err_timeslot_denied++;
      break;
  }
#endif /* defined ZB_NRF52_RADIO_STATISTICS */

