lab11/nrf52x-base/sdk/nrf5_sdk_16.0.0_thread/external/zboss/osif/zb_nrf52_transceiver.c
  switch(error)
  {
    case NRF_802154_TX_ERROR_NO_MEM:
    case NRF_802154_TX_ERROR_ABORTED:
    case NRF_802154_TX_ERROR_TIMESLOT_DENIED:
    case NRF_802154_TX_ERROR_TIMESLOT_ENDED:
    case NRF_802154_TX_ERROR_BUSY_CHANNEL:
      mac_nrf52_transmit_failed(ZB_TRANS_CHANNEL_BUSY_ERROR);
      break;

    case NRF_802154_TX_ERROR_INVALID_ACK:
    case NRF_802154_TX_ERROR_NO_ACK:
      mac_nrf52_transmit_failed(ZB_TRANS_NO_ACK);
      break;
  }
}

/**
 * @brief Notify that frame was received.
 *
 * @note Buffer pointed by the p_data pointer is not modified by the radio driver (and can't
 *       be used to receive a frame) until nrf_802154_buffer_free_raw() function is called.
 * @note Buffer pointed by the p_data pointer may be modified by the function handler (and other
 *       modules) until @sa nrf_802154_buffer_free_raw() function is called.
 * @note The next higher layer should handle @sa nrf_802154_received_raw() or @sa
 *       nrf_802154_received() function. It should not handle both.
 *
 * p_data
 * v
 * +-----+-----------------------------------------------------------+------------+
 * | PHR | MAC Header and payload                                    | FCS        |
 * +-----+-----------------------------------------------------------+------------+
 *       |                                                                        |
 *       | <---------------------------- PHR -----------------------------------> |
 *
 * @param[in]  p_data  Pointer to the buffer containing received data (PHR + PSDU). First byte in
 *                     the buffer is length of the frame (PHR) and following bytes is the frame
 *                     itself (PSDU). Length byte (PHR) includes FCS. FCS is already verified by
 *                     the hardware and may be modified by the hardware.
 * @param[in]  power   RSSI of received frame.
 * @param[in]  lqi     LQI of received frame.
 */
void nrf_802154_received_timestamp_raw(uint8_t * p_data, int8_t power, uint8_t lqi, uint32_t time)
{
#if defined ZB_NRF52_RADIO_STATISTICS
  zb_nrf52_get_radio_stats()->rx_successful++;
#endif /* defined ZB_NRF52_RADIO_STATISTICS */

  mac_nrf52_received_timestamp_raw(p_data, power, lqi, time);
}

/**
 * @brief Notify that reception of a frame failed.
 *
 * @param[in]  error  An error code that indicates reason of the failure.
 */
void nrf_802154_receive_failed(nrf_802154_rx_error_t error)
{
#if defined ZB_NRF52_RADIO_STATISTICS
  switch (error)
  {
    case NRF_802154_RX_ERROR_NONE:
      zb_nrf52_get_radio_stats()->rx_err_none++;
      break;

    case NRF_802154_RX_ERROR_INVALID_FRAME:
      zb_nrf52_get_radio_stats()->rx_err_invalid_frame++;
      break;
    case NRF_802154_RX_ERROR_INVALID_FCS:
      zb_nrf52_get_radio_stats()->rx_err_invalid_fcs++;
      break;
    case NRF_802154_RX_ERROR_INVALID_DEST_ADDR:
      zb_nrf52_get_radio_stats()->rx_err_invalid_dest_addr++;
      break;
    case NRF_802154_RX_ERROR_RUNTIME:
      zb_nrf52_get_radio_stats()->rx_err_runtime++;
      break;
    case NRF_802154_RX_ERROR_TIMESLOT_ENDED:
      zb_nrf52_get_radio_stats()->rx_err_timeslot_ended++;
      break;
    case NRF_802154_RX_ERROR_ABORTED:
      zb_nrf52_get_radio_stats()->rx_err_aborted++;
      break;
  }
#endif /* defined ZB_NRF52_RADIO_STATISTICS */

  /* Should be disabled in MAC certification tests, so TRACE_MAC1 is used. */
  TRACE_ENTER_INT();
  TRACE_MSG(TRACE_MAC1, ">> nrf_802154_receive_failed, %d ", (FMT__D, error));
  TRACE_LEAVE_INT();
}

zb_bool_t zb_transceiver_set_pending_bit(zb_uint8_t *addr, zb_bool_t value, zb_bool_t extended)
{
  return ((value) ?
    (zb_bool_t)nrf_802154_pending_bit_for_addr_clear((const uint8_t *)addr, extended) :
    (zb_bool_t)nrf_802154_pending_bit_for_addr_set((const uint8_t *)addr, extended));
}

void zb_transceiver_src_match_tbl_drop(void)
{
  TRACE_MSG(TRACE_MAC3, ">>mac_nrf52840_src_match_tbl_drop", (FMT__0));
  nrf_802154_pending_bit_for_addr_reset(ZB_FALSE); /* reset for short addresses */
  nrf_802154_pending_bit_for_addr_reset(ZB_TRUE);  /* reset for long addresses */
  TRACE_MSG(TRACE_MAC3, "<<mac_nrf52840_src_match_tbl_drop", (FMT__0));
}
